app/controllers/players_controller.rb

SELECT "players".* FROM "players" ORDER BY pts
---
  def index
    @players = Player.order(params[:sort] + " " + params[:direction])

INSERT INTO "players" ("created_at", "fg", "ft", "name", "position", "tpm", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", Mon, 28 Oct 2013 03:01:37 UTC +00:00], ["fg", 0.0], ["ft", 0.0], ["name", "Arty"], ["position", "is "], ["tpm", 0.0], ["updated_at", Mon, 28 Oct 2013 03:01:37 UTC +00:00]]
---
  def create
    @player = Player.new(player_params)

    respond_to do |format|
      if @player.save

DELETE FROM "players" WHERE "players"."id" = ?  [["id", 1]]
---
  def destroy
    @player.destroy

SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_player
      @player = Player.find(params[:id])